# Conductor Material Name Property

Source: https://www.revitapidocs.com/2026/c905d9d4-a554-a6ce-e442-78d6c9c8e862.htm

---

| Conductor Material Name Property |
| --- |

The Conductor Material name.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public string Name { get; set; }
```

```
Public Property Name As String
	Get
	Set
```

```
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
```

```
member Name : string with get, set
```

#### Property Value

String Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: name is an empty string or contains only whitespace.  \-or\-  When setting this property: name cannot include prohibited characters, such as "{, }, \[, ], \|, ;, less\-than sign, greater\-than sign, ?, \`, \~".  \-or\-  When setting this property: name is not unique in document. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

ConductorMaterial Class Autodesk.Revit.DB.Electrical Namespace